Tekla Open API Reference for Tekla Structures 2025
AnalysisVolume.Volume Property
 The volume item.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisVolumeItem Volume { get; }
Public ReadOnly Property Volume As AnalysisVolumeItem
	Get
Property Value
Type: AnalysisVolumeItem
See Also
Reference
AnalysisVolume Class
Tekla.Structures.Analysis Namespace